Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоСериям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуги</Name>
					<Comment>(удалить, заменен на ТипНоменклатуры)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретОтгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПоставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Блок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппыДляКонструктора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТелеграм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПодбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПодбораНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьИзАссортимента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Номенклатура/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ глПриСозданииНаСервереСписок(ЭтаФорма) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
	//Элементы.ФормаСлужба.Видимость = гоАдминистратор();   

	// © Primus1C  14.07.2023  НАЧАЛО ► 
	
	Если Элементы.Список.ПодчиненныеЭлементы.Найти("Флаг") <> Неопределено Тогда
		лРежим = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОтображатьФлагиВСписке");
		Элементы.Список.ПодчиненныеЭлементы.Флаг.Видимость = лРежим;
		Если лРежим Тогда
			ОбщегоНазначения.ДополнитьТекстЗапросаСпецификациями(Список.ТекстЗапроса, "Спецификации.ЗначениеСвойства.Наименование");
		КонецЕсли;
	КонецЕсли;
	
	глПокраситьУслуги(ЭтаФорма);
	глПокраситьПомеченныеНаУдаление(ЭтаФорма);  
	ДоступноРедактированиеВеса = РольДоступна("Администратор") ИЛИ 
		РольДоступна("ИзменениеНоменклатуры") ИЛИ 
		РольДоступна("ИзменениеВесаНоменклатуры");
		
	Элементы.Остаток.Видимость = ОбщегоНазначенияПовтИсп.ЕстьДоступКОстаткамТоваров(); 
	
	//+
	//Эле = Дерево.УсловноеОформление.Элементы.Добавить();
	////Эле.ИдентификаторПользовательскойНастройки = "ВыводитьИзАссортимента";
	////Эле.Представление = "ВыводитьИзАссортимента";
	//Эле.Использование = Истина;
	////Эле.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;	//Недоступный
	//	
	//Отб = Эле.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//Отб.Использование = Истина;
	//Отб.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВыводитьИзАссортимента");
	//Отб.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
	//Отб.ПравоеЗначение = Истина;
	//Пол = Эле.Поля.Элементы.Добавить();
	//Пол.Использование = Истина;
	//Эле.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗеленый);

	УстановитьОформлениеДереваНаСервере();
	//-
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеДереваНаСервере()
	
	// 1. Создаем новый элемент условного оформления формы
	ЭлементОформления = ЭтаФорма.Дерево.УсловноеОформление.Элементы.Добавить();
	
	// 2. Устанавливаем цвет фона
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.АкварельноСиний);
	
	// 3. Добавляем ПЕРВОЕ условие: строка должна быть Группой справочника
	УсловиеГруппа = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	УсловиеГруппа.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЭтоГруппа");
	УсловиеГруппа.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	УсловиеГруппа.ПравоеЗначение = Истина;
	
	// 4. Добавляем ВТОРОЕ условие: реквизит "ВыводитьИзАссортимента" равен Истина
	// Несколько условий в одном элементе оформления по умолчанию соединяются по "И"
	УсловиеРеквизит = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	УсловиеРеквизит.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ВыводитьИзАссортимента");
	УсловиеРеквизит.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	УсловиеРеквизит.ПравоеЗначение = Истина;
	
	// 5. Оформляемые поля (колонки)
	// Если коллекцию "Поля" оставить пустой, цвет применится ко всей строке целиком.
	// Если нужно подсветить только конкретную колонку, раскомментируйте код ниже:
	
	 ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	 ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Наименование");
	 ПолеОформления.Использование = Истина;
	
КонецПроцедуры  

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	// © Primus1C  24.04.2024  НАЧАЛО ►  
	Если Поле.Имя = "Вес" И ДоступноРедактированиеВеса И НЕ Элемент.ТекущиеДанные.ЭтоГруппа Тогда
		Вес = Элемент.ТекущиеДанные.Вес;
		//Если ВвестиЧисло(Вес, НСтр("ru = 'Введите вес'; en = 'Input weight'"), 5, 0)  Тогда
		//	Ошибка = "";
		//	ЗаписатьВесНоменклатуры(ВыбраннаяСтрока, Вес, Ошибка); 
		//	Если Ошибка = "" Тогда
		//		ОповеститьОбИзменении(ВыбраннаяСтрока);
		//	  	ПоказатьОповещениеПользователя( ВыбраннаяСтрока, ,
		//										НСтр("ru = 'Записан вес номенклатуры: '; en = 'Recorded weight of good: '") + Вес,
		//										БиблиотекаКартинок.Инфо);
		//	Иначе 
		//		Сообщить(Ошибка);
		//	КонецЕсли;
		//КонецЕсли;
		ПоказатьВводЧисла(Новый ОписаниеОповещения("СписокВыборПослеВводаВеса", ЭтотОбъект, ВыбраннаяСтрока), Вес, НСтр("ru = 'Введите вес'; en = 'Input weight'"), 5, 0);
	КонецЕсли;
	// © Primus1C  ОКОНЧАНИЕ ◄
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборПослеВводаВеса(Вес, ВыбраннаяСтрока) Экспорт
	Если Вес = Неопределено Тогда Возврат КонецЕсли;
	Ошибка = "";
	ЗаписатьВесНоменклатуры(ВыбраннаяСтрока, Вес, Ошибка); 
	Если Ошибка = "" Тогда
		ОповеститьОбИзменении(ВыбраннаяСтрока);
	  	ПоказатьОповещениеПользователя( ВыбраннаяСтрока, ,
										НСтр("ru = 'Записан вес номенклатуры: '; en = 'Recorded weight of good: '") + Вес,
										БиблиотекаКартинок.Инфо);
	Иначе 
		Сообщить(Ошибка);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВсеПараметры()
	//гоСтандартныйОтбор(Список, 0, ТолькоОстатки);
	//2016.05.29
	//добавили условие, чтобы были видны и услуги, на которых нет остатков
	//стандартный отбор больше не годится, потому что нужно сразу три элемента включать/выключать
	Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование = ТолькоОстатки;
	Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Элементы[0].Использование = ТолькоОстатки;
	//Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Элементы[1].Использование = ТолькоОстатки;
	//2016.06.21
	//не хотят услуги
	Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Элементы[1].Использование = Ложь;
	
	Список.Параметры.УстановитьЗначениеПараметра("Фирма", гоФирма());
	
	Если ФильтрСклады.Количество() = 0 Тогда
		Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ФильтрСклады")).Использование = Ложь;
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ФильтрСклады", ФильтрСклады.ВыгрузитьЗначения());
	КонецЕсли; 
	
	ЭтаФорма.Модифицированность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	// © Primus1C  06.04.2025  НАЧАЛО ►
	ПроцентВесТарыПриИзменении(Неопределено);
	// © Primus1C  ОКОНЧАНИЕ ◄
	УстановитьВсеПараметры();
	Элементы.Список.ТекущаяСтрока = ТекущаяПозиция;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСкладыПриИзменении(Элемент)
	УстановитьВсеПараметры();
КонецПроцедуры

&НаКлиенте
Процедура ТолькоОстаткиПриИзменении(Элемент)
	УстановитьВсеПараметры();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	ТекущаяПозиция = Элементы.Список.ТекущаяСтрока;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СлужбаНаСервере(Имя, Р)
	Т = Новый ТекстовыйДокумент;
	Т.Прочитать(Имя);
	
	Кол = Т.КоличествоСтрок();
	Для Н = 1 По Кол Цикл
		Стр = Т.ПолучитьСтроку(Н);
		Если СокрЛП(Стр) = "" Тогда Продолжить КонецЕсли;
		
		НомИмя = гоСледПолеТаб(Стр, "Строка");
		НомФла = 1;
		
		НовНом = Справочники.Номенклатура.НайтиПоНаименованию(НомИмя);
		Если НЕ НовНом.Пустая() Тогда гоРезСоо(Р, "Уже есть номенклатура: " + НомИмя); Продолжить; КонецЕсли; 
		
		НовНом = Справочники.Номенклатура.СоздатьЭлемент();
		НовНом.Наименование = НомИмя;
		НовНом.УчетПоСериям = (НомФла = 1);
		Попытка
			НовНом.Записать();
		Исключение
		    гоРезСоо(Р, ОписаниеОшибки());
		КонецПопытки; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура Служба(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл с накладной:";
	Диалог.Фильтр = "Текстовые файлы (*.txt)|*.txt";
	Если НЕ Диалог.Выбрать() Тогда Возврат КонецЕсли;
	
	Имя = Диалог.ПолноеИмяФайла;
	Фай = Новый Файл(Имя);
	Если НЕ Фай.Существует() Тогда клОшибка("Не найден файл " + гоИмя(Имя) + "!"); Возврат; КонецЕсли;
	
	Р = "";
	СлужбаНаСервере(Имя, Р);
	клЕстьОшибка(Р);
КонецПроцедуры

&НаКлиенте
Процедура ИскатьНоменклатуру(Команда)
//2016.07.20
	
	ЭтаФорма.ТекущийЭлемент = Элементы.Список;
	//НовНом = клИскатьНоменклатуру(Элементы.Список.ТекущаяСтрока);
	//Если НовНом = Неопределено Тогда Возврат КонецЕсли; 
	//Элементы.Список.ТекущаяСтрока = НовНом;  
	клИскатьНоменклатуру(Новый ОписаниеОповещения("ИскатьНоменклатуруПослеПоиска", ЭтотОбъект), Элементы.Список.ТекущаяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура ИскатьНоменклатуруПослеПоиска(НовНом, ДопПараметры) Экспорт
	Если НовНом = Неопределено Тогда Возврат КонецЕсли; 
	Элементы.Список.ТекущаяСтрока = НовНом;
КонецПроцедуры


// © Primus1C  24.04.2024  НАЧАЛО ► 

&НаСервереБезКонтекста
Процедура ЗаписатьВесНоменклатуры(Номенклатура, Вес, Ошибка)

	НомОбъект = Номенклатура.ПолучитьОбъект();
	НомОбъект.Вес = Вес;
	Попытка
	    НомОбъект.Записать();
	Исключение
		Ошибка = СтрШаблон("%1 %2: %3",
							НСтр("ru = 'Не удалось записать номенклатуру'; en = 'Failed to record nomenclature'"),
							Номенклатура,
							ОписаниеОшибки());	
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ПроцентВесТарыПриИзменении(Элемент)

	УстановитьПераметрыСписка();

КонецПроцедуры 

 &НаСервере
 Процедура УстановитьПераметрыСписка()

 	Список.Параметры.УстановитьЗначениеПараметра("ПроцентВес", ЭтаФорма.ПроцентВесТары);

 КонецПроцедуры 
 
// © Primus1C  ОКОНЧАНИЕ ◄
